app/views/students/new.html.erb


<%= collection_select(:student, :school_id, School.all, :id, :name) %>
---
SELECT "schools".* FROM "schools"