app/controllers/students_controller.rb

  def create
    @student = Student.create(student_params)
---
INSERT INTO "students" ("name", "age", "created_at", "updated_at", "school_id") VALUES (?, ?, ?, ?, ?)  [["name", "Ty"], ["age", 22], ["created_at", "2020-02-03 18:06:03.626417"], ["updated_at", "2020-02-03 18:06:03.626417"], ["school_id", 12]]

  def update
    @student = Student.find(params[:id])
    @student.update(student_params)
---
SELECT  "students".* FROM "students" WHERE "students"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "students" SET "school_id" = ?, "updated_at" = ? WHERE "students"."id" = ?  [["school_id", 15], ["updated_at", "2020-02-03 18:09:32.290981"], ["id", 1]]

  def destroy
    @student = Student.find(params[:id])
    @student.delete
---
SELECT  "students".* FROM "students" WHERE "students"."id" = ? LIMIT ?  [["id", 13], ["LIMIT", 1]]
DELETE FROM "students" WHERE "students"."id" = ?  [["id", 3]]